# 1. Используем официальный легковесный образ Python
FROM python:3.11-slim

# 2. Настройки Python для контейнеров:
# Не писать байт код .pyc файлы (экономит место) - код компилируется прямо в оперативной памяти
ENV PYTHONDONTWRITEBYTECODE=1

# Не буферизировать логи -  по умолчанию Python использует "буферизацию вывода" (standard I/O buffering)),
# чтобы логи сразу появлялись в консоли/алертах) - для просмотра логов в реальном времени: docker logs -f my-app
ENV PYTHONUNBUFFERED=1

# 3. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 4. СОЗДАЕМ НЕПРИВИЛЕГИРОВАННОГО ПОЛЬЗОВАТЕЛЯ (Best Practice безопасности)
# Запуск контейнеров от root - это огромная дыра в безопасности.
RUN useradd -d /home/appuser -s /bin/bash -m appuser

# 5. КЭШИРОВАНИЕ СЛОЕВ
# Сначала копируем ТОЛЬКО requirements.txt.
# Если зависимости не менялись, Docker возьмет этот шаг из кэша и сборка пройдет за 1 секунду.
COPY requirements.txt .

# Устанавливаем зависимости (--no-cache-dir удаляет установочный мусор pip)
RUN pip install -r requirements.txt --no-cache-dir

# 6. Копируем остальной код проекта
COPY . .

# 7. Отдаем права на файлы нашему пользователю
RUN chown -R appuser:appuser /app

# 8. Переключаемся на безопасного пользователя
USER appuser

# 9. Сообщаем, что контейнер слушает порт 8501 (стандарт Streamlit)
EXPOSE 8501

# 10. Команда запуска
# ВАЖНО: замени 'app.py' на имя твоего главного файла!
CMD ["streamlit", "run", "app.py", "--server.port=8501", "--server.address=0.0.0.0"]
